# PYTHON JOIN

### André Ricardo
### <a href="http://www.andrericardo.com.br">Site</a>
### <a href="https://www.youtube.com/channel/UCmlOAr1Y0msRLpPyLrjGp-Q">Youtube</a>
### <a href="https://pandas.pydata.org/docs/reference/api/pandas.merge.html">Documentação Pandas Merge</a>

## Apresentação

Em algum momento dos seus estudos em python ou qualquer outra linguagem, você irá se deparar com o desafio de juntar dados. <br>
Para isto é muito comum o uso de **join** ou **merge** nas linguagens para fazer esta conexão entre os dados.
<br><br>
Inevitavelmente você irá se deprar com esta imagem:

<img src='https://terminalroot.com.br/assets/img/mysql/joins-mysql.jpg' width=80%>

## Instalação do pandas

In [1]:
!pip install pandas

Página de código ativa: 1252
Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.3.5)
Requirement already satisfied: pytz>=2017.3 in d:\anaconda\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.17.3; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" in d:\anaconda\lib\site-packages (from pandas) (1.19.1)
Requirement already satisfied: python-dateutil>=2.7.3 in d:\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

## import do pandas

In [2]:
import pandas as pd

## Versão do pandas

In [3]:
print(pd.__version__)

1.3.5

## Criando o dataframe tabela_A

In [4]:
tabela_A = pd.DataFrame({'ID': range(1, 11),
                         'Nome': ['João', 'Mario', 'Pedro', 'Andre', 'Luiz', 'Carlos', 'Marcos', 'Rafael', 'Diego', 'Leandro']})

tabela_A

   ID     Nome
0   1     João
1   2    Mario
2   3    Pedro
3   4    Andre
4   5     Luiz
5   6   Carlos
6   7   Marcos
7   8   Rafael
8   9    Diego
9  10  Leandro

## Criando o dataframe tabela_B

In [5]:
tabela_B = pd.DataFrame({'ID': range(2, 13, 2),
                         'Nome': ['Sofia', 'Deise', 'Luiza', 'Claudia', 'Beatriz', 'Vitória']})
tabela_B

   ID     Nome
0   2    Sofia
1   4    Deise
2   6    Luiza
3   8  Claudia
4  10  Beatriz
5  12  Vitória

## Inner Join
<img src="https://terminalroot.com.br/assets/img/mysql/inner_join.jpg">

In [6]:
#inner_join = pd.merge(tabela_A, tabela_B, on='ID', how='inner')
inner_join = pd.merge(tabela_A, tabela_B, on='ID')

print("\nResultado do Inner Join:")
inner_join

Resultado do Inner Join:

   ID   Nome_x   Nome_y
0   2    Mario    Sofia
1   4    Andre    Deise
2   6   Carlos    Luiza
3   8   Rafael  Claudia
4  10  Leandro  Beatriz

## Left (Outer) Join

<img src="https://terminalroot.com.br/assets/img/mysql/left_join.jpg">

In [7]:
left_join = pd.merge(tabela_A, tabela_B, on='ID', how='left')
print("\nResultado do Left Join:")
left_join

Resultado do Left Join:

   ID   Nome_x   Nome_y
0   1     João      NaN
1   2    Mario    Sofia
2   3    Pedro      NaN
3   4    Andre    Deise
4   5     Luiz      NaN
5   6   Carlos    Luiza
6   7   Marcos      NaN
7   8   Rafael  Claudia
8   9    Diego      NaN
9  10  Leandro  Beatriz

## Right (Outer) Join

<img src="https://terminalroot.com.br/assets/img/mysql/right_join.jpg">

In [8]:
right_join = pd.merge(tabela_A, tabela_B, on='ID', how='right')
print("\nResultado do Right Join:")
right_join

Resultado do Right Join:

   ID   Nome_x   Nome_y
0   2    Mario    Sofia
1   4    Andre    Deise
2   6   Carlos    Luiza
3   8   Rafael  Claudia
4  10  Leandro  Beatriz
5  12      NaN  Vitória

## Full (Outer ) Join

<img src="https://miro.medium.com/v2/resize:fit:526/format:webp/1*59vkO2OIEOLJ01kWdsezow.png">

In [9]:
full_join = pd.merge(tabela_A, tabela_B, on='ID', how='outer')
print("\nResultado do Full Join:")
full_join

Resultado do Full Join:

    ID   Nome_x   Nome_y
0    1     João      NaN
1    2    Mario    Sofia
2    3    Pedro      NaN
3    4    Andre    Deise
4    5     Luiz      NaN
5    6   Carlos    Luiza
6    7   Marcos      NaN
7    8   Rafael  Claudia
8    9    Diego      NaN
9   10  Leandro  Beatriz
10  12      NaN  Vitória

## Left Join Excluding Inner Join

<img src="https://miro.medium.com/v2/resize:fit:522/format:webp/1*ifV1zpEoKv42FV0MQXpbyQ.png">

In [10]:
left_join_tmp = pd.merge(tabela_A, tabela_B, on=['ID'], how="outer", indicator=True)
left_join_tmp

    ID   Nome_x   Nome_y      _merge
0    1     João      NaN   left_only
1    2    Mario    Sofia        both
2    3    Pedro      NaN   left_only
3    4    Andre    Deise        both
4    5     Luiz      NaN   left_only
5    6   Carlos    Luiza        both
6    7   Marcos      NaN   left_only
7    8   Rafael  Claudia        both
8    9    Diego      NaN   left_only
9   10  Leandro  Beatriz        both
10  12      NaN  Vitória  right_only

In [11]:
left_join_excluding = pd.merge(tabela_A, tabela_B, on=['ID'], how="outer", indicator=True).query('_merge=="left_only"')
left_join_excluding

   ID  Nome_x Nome_y     _merge
0   1    João    NaN  left_only
2   3   Pedro    NaN  left_only
4   5    Luiz    NaN  left_only
6   7  Marcos    NaN  left_only
8   9   Diego    NaN  left_only

## Right Join Excluding Inner Join

<img src="https://miro.medium.com/v2/resize:fit:526/format:webp/1*Cne0Pc2j5jE3O2lV-SqBLg.png">

In [12]:
right_join_tmp = pd.merge(tabela_A, tabela_B, on=['ID'], how="outer", indicator=True)
right_join_tmp

    ID   Nome_x   Nome_y      _merge
0    1     João      NaN   left_only
1    2    Mario    Sofia        both
2    3    Pedro      NaN   left_only
3    4    Andre    Deise        both
4    5     Luiz      NaN   left_only
5    6   Carlos    Luiza        both
6    7   Marcos      NaN   left_only
7    8   Rafael  Claudia        both
8    9    Diego      NaN   left_only
9   10  Leandro  Beatriz        both
10  12      NaN  Vitória  right_only

In [13]:
right_join_excluding = pd.merge(tabela_A, tabela_B, on=['ID'], how="outer", indicator=True).query('_merge=="right_only"')
right_join_excluding

    ID Nome_x   Nome_y      _merge
10  12    NaN  Vitória  right_only

## Full ( Outer ) Join Excluding Inner Join

<img src="https://miro.medium.com/v2/resize:fit:524/format:webp/1*Tiui48QBP8DTl9EcWSP9TA.png">

In [14]:
# Tudo que existe na tabela A, mas que não tenha o ID na tabela B
r1 = tabela_A[~tabela_A['ID'].isin(tabela_B['ID'])]
r1

   ID    Nome
0   1    João
2   3   Pedro
4   5    Luiz
6   7  Marcos
8   9   Diego

In [15]:
# Tudo que existe na tabela B, mas que não tenha o ID na tabela A
r2 = tabela_B[~tabela_B['ID'].isin(tabela_A['ID'])]
r2

   ID     Nome
5  12  Vitória

In [16]:
# juntando os resultados
# full_outer_join = pd.concat([r1, r2])
full_outer_join = pd.concat([r1, r2]).reset_index(drop=True)
full_outer_join

   ID     Nome
0   1     João
1   3    Pedro
2   5     Luiz
3   7   Marcos
4   9    Diego
5  12  Vitória

## Cross Join

<img src="https://i1.wp.com/paulohcc.com/wp-content/uploads/2020/09/CROSS-JOIN.png?w=635&ssl=1">

In [18]:
cross_join = pd.merge(tabela_A, tabela_B, how="cross")
cross_join

    ID_x   Nome_x  ID_y   Nome_y
0      1     João     2    Sofia
1      1     João     4    Deise
2      1     João     6    Luiza
3      1     João     8  Claudia
4      1     João    10  Beatriz
5      1     João    12  Vitória
6      2    Mario     2    Sofia
7      2    Mario     4    Deise
8      2    Mario     6    Luiza
9      2    Mario     8  Claudia
10     2    Mario    10  Beatriz
11     2    Mario    12  Vitória
12     3    Pedro     2    Sofia
13     3    Pedro     4    Deise
14     3    Pedro     6    Luiza
15     3    Pedro     8  Claudia
16     3    Pedro    10  Beatriz
17     3    Pedro    12  Vitória
18     4    Andre     2    Sofia
19     4    Andre     4    Deise
20     4    Andre     6    Luiza
21     4    Andre     8  Claudia
22     4    Andre    10  Beatriz
23     4    Andre    12  Vitória
24     5     Luiz     2    Sofia
25     5     Luiz     4    Deise
26     5     Luiz     6    Luiza
27     5     Luiz     8  Claudia
28     5     Luiz    10  Beatriz
29     5     Luiz    12  Vitória
30     6   Carlos     2    Sofia
31     6   Carlos     4    Deise
32     6   Carlos     6    Luiza
33     6   Carlos     8  Claudia
34     6   Carlos    10  Beatriz
35     6   Carlos    12  Vitória
36     7   Marcos     2    Sofia
37     7   Marcos     4    Deise
38     7   Marcos     6    Luiza
39     7   Marcos     8  Claudia
40     7   Marcos    10  Beatriz
41     7   Marcos    12  Vitória
42     8   Rafael     2    Sofia
43     8   Rafael     4    Deise
44     8   Rafael     6    Luiza
45     8   Rafael     8  Claudia
46     8   Rafael    10  Beatriz
47     8   Rafael    12  Vitória
48     9    Diego     2    Sofia
49     9    Diego     4    Deise
50     9    Diego     6    Luiza
51     9    Diego     8  Claudia
52     9    Diego    10  Beatriz
53     9    Diego    12  Vitória
54    10  Leandro     2    Sofia
55    10  Leandro     4    Deise
56    10  Leandro     6    Luiza
57    10  Leandro     8  Claudia
58    10  Leandro    10  Beatriz
59    10  Leandro    12  Vitória